/*******************************************************************************
 * @file    Port_Cfg.h
 * @author  Do Duc Nghia
 * @brief   Port Config Header File
 * @details File này cấu hình sẵn cho port của vi điều khiển STM32F10x
 *
 * @version 1.0
 * @date    2025-06-25
 * *****************************************************************************
 */
#ifndef PORT_CFG_H
#define PORT_CFG_H

/********************************************************************
 * ====================== [ INCLUDE LIBRARY ] =======================
 ********************************************************************/
#include "Port.h"

/********************************************************************
 * @brief   Xác định số trường hợp chân mà chúng ta định nghĩa
 ********************************************************************/
#define NUM_PINS 1U

/********************************************************************
 * @brief   Định nghĩa sẵn cấu hình các chân
 ********************************************************************/
extern const Port_PinConfigType pinConfigs[NUM_PINS];

/********************************************************************
 * @brief   Xác định cấu hình port chung
 ********************************************************************/
extern const Port_ConfigType Port_Config;

#endif